## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:85" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:85" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:d10dd37ead41488981d34d6e37b5df46e189bf52cf60dd42326a86a12ec4859f" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:910130667f4a81d1914323b40a5d43c1eeb077208d25b27a452ef1d1b8715911"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 85 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "0603923bf51900b3ccf4f930b3d340f0-6" -> "938984eea36f7f37854f599588f82097"
        id                     = "graphql.938984eea36f7f37854f599588f82097.zip"
        tags                   = {}
      ~ version_id             = "YPEm5dddtOf95_8e1DXoleR_arWq0H3f" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = ".qfOybp0a37HJU5GOarM16aRnbqNp.My" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.931e3ec57f620c7c0789d106b3e32253.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2e0d4763a09795b744207f978524e4a3-4" -> "d71d6f249c218fc6bb0df8e47e440134"
      ~ id                     = "python.931e3ec57f620c7c0789d106b3e32253.zip" -> (known after apply)
      ~ key                    = "python.931e3ec57f620c7c0789d106b3e32253.zip" -> "python.d71d6f249c218fc6bb0df8e47e440134.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "931e3ec57f620c7c0789d106b3e32253" -> "d71d6f249c218fc6bb0df8e47e440134"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "wEtHa6hjI3NgAaInzRCNtWxQobsBiWwk" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f644dd1e0acc523310628d636e07919b" -> "c851a7ddcbde1b26f12490e982f8c2c1"
        id                     = "dist/200.html"
      ~ source_hash            = "f644dd1e0acc523310628d636e07919b" -> "c851a7ddcbde1b26f12490e982f8c2c1"
        tags                   = {}
      ~ version_id             = "9G.rVpJk9DWMhZ2L7qemnP3hNNcCUN6w" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2d2bb5e2d9a2cfd278d34d6cab93d02a" -> "373d6929773c33cf2ad310ca3274d4e0"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "2d2bb5e2d9a2cfd278d34d6cab93d02a" -> "373d6929773c33cf2ad310ca3274d4e0"
        tags                   = {}
      ~ version_id             = "O6p2WMJaTC2H6lMLSaqU_DXWyI8YNUVp" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "84b8882cafbc7c4ebe51aca2f7b7425c" -> "d705d4c75561928c8d8e0736d50532f8"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "84b8882cafbc7c4ebe51aca2f7b7425c" -> "d705d4c75561928c8d8e0736d50532f8"
        tags                   = {}
      ~ version_id             = "2GRrKU0zH0qE18o249xXJ7X5PKAu58if" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f644dd1e0acc523310628d636e07919b" -> "c851a7ddcbde1b26f12490e982f8c2c1"
        id                     = "dist/index.html"
      ~ source_hash            = "f644dd1e0acc523310628d636e07919b" -> "c851a7ddcbde1b26f12490e982f8c2c1"
        tags                   = {}
      ~ version_id             = "89reAB7p6KmFwKPt_6cQXKBZyTuQFkj2" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.bf6e696e.chunk.js"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.bf6e696e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "51635af00c9a26b1f9892de818959cee" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js" -> null
-       source_hash            = "51635af00c9a26b1f9892de818959cee" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Jkptsz2p1daJUyT3IcmcP.8R2xXBjbFt" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "XthLxKeka1jCfcq_xlmHc9PLSpe3A2L_" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.d06efcd8.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "627532baa4776747fd6bb78564995b86"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.d06efcd8.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.d06efcd8.chunk.js"
+       source_hash            = "627532baa4776747fd6bb78564995b86"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.d06efcd8.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.d06efcd8.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.d06efcd8.chunk.js.LICENSE.txt"
+       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.243ff62d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "eaad34f40587f24b3edac96753badd41"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.243ff62d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.243ff62d.chunk.js"
+       source_hash            = "eaad34f40587f24b3edac96753badd41"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.243ff62d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.243ff62d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.243ff62d.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c60caf40.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.c60caf40.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadNewUploadPage.c60caf40.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9495b3dee576dda5103e036739c951b9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.c60caf40.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.c60caf40.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c60caf40.chunk.js" -> null
-       source_hash            = "9495b3dee576dda5103e036739c951b9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "C_g_iQy24kZu8odfipuPjEBVzLSUl_KQ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "cc27fa172211f2877b50629ac7228a71" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt" -> null
-       source_hash            = "cc27fa172211f2877b50629ac7228a71" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "SOQZ0kAvKZIrxYywf7TktItAiJ72RBZl" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ef71718f.js"] will be destroyed
  # (because key ["static/js/app.ef71718f.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.ef71718f.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "6db1a1d771b573734a0e7eb9e0bfc263" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.ef71718f.js" -> null
-       key                    = "dist/static/js/app.ef71718f.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ef71718f.js" -> null
-       source_hash            = "6db1a1d771b573734a0e7eb9e0bfc263" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PMKT8_fa2iQggj9uFQnUWC5KokDeONq0" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ef71718f.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.ef71718f.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.ef71718f.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.ef71718f.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.ef71718f.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ef71718f.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "tTZ5dqtCNf_a3n_fAS4IMBknFrk24ak3" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.8e05637f.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "36755dc78098d7f41e34aa50ab84763e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.8e05637f.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.8e05637f.js"
+       source_hash            = "36755dc78098d7f41e34aa50ab84763e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.ad9e1ce3.js"] will be destroyed
  # (because key ["static/js/runtime-app.ad9e1ce3.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/runtime-app.ad9e1ce3.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "038c465487bde88aebc28f6c9a876b95" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.ad9e1ce3.js" -> null
-       key                    = "dist/static/js/runtime-app.ad9e1ce3.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.ad9e1ce3.js" -> null
-       source_hash            = "038c465487bde88aebc28f6c9a876b95" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "lcHJkGQBCRLKu9FHhCGraDvWFg7xBu7s" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-11T17:28:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:52" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:52/invocations" -> (known after apply)
      ~ s3_key                         = "python.931e3ec57f620c7c0789d106b3e32253.zip" -> "python.d71d6f249c218fc6bb0df8e47e440134.zip"
        tags                           = {}
      ~ version                        = "52" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "560abef918dd5bdcb145d713cfdfd1fe022fe2b6" -> "7bc86c2b9f4ebec07ab63b73d8db972709d17a14"
              ~ "DD_TAGS"                      = "git.commit.sha:560abef918dd5bdcb145d713cfdfd1fe022fe2b6,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:7bc86c2b9f4ebec07ab63b73d8db972709d17a14,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "560abef918dd5bdcb145d713cfdfd1fe022fe2b6" -> "7bc86c2b9f4ebec07ab63b73d8db972709d17a14"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "52" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:100" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:100/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "100" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "560abef918dd5bdcb145d713cfdfd1fe022fe2b6" -> "7bc86c2b9f4ebec07ab63b73d8db972709d17a14"
              ~ "DD_TAGS"                            = "git.commit.sha:560abef918dd5bdcb145d713cfdfd1fe022fe2b6,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:7bc86c2b9f4ebec07ab63b73d8db972709d17a14,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "560abef918dd5bdcb145d713cfdfd1fe022fe2b6" -> "7bc86c2b9f4ebec07ab63b73d8db972709d17a14"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "100" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "560abef918dd5bdcb145d713cfdfd1fe022fe2b6" -> "7bc86c2b9f4ebec07ab63b73d8db972709d17a14"
              ~ "DD_TAGS"                      = "git.commit.sha:560abef918dd5bdcb145d713cfdfd1fe022fe2b6,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:7bc86c2b9f4ebec07ab63b73d8db972709d17a14,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "560abef918dd5bdcb145d713cfdfd1fe022fe2b6" -> "7bc86c2b9f4ebec07ab63b73d8db972709d17a14"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 10 to change, 12 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8651083677)*